justinh-rahb/pandavent-klipper/firmware/sdkconfig.defaults
# Target the classic ESP32 (Xtensa dual-core LX6) — same silicon as stock.
CONFIG_IDF_TARGET="esp32"

# 4 MB flash matches the stock Panda Vent module (see esptool image-info).
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Use our OTA-capable partition table.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Room for logs before wifi/httpd come up.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Captive-portal detection probes from iOS / Android / Windows arrive with
# 700+ bytes of headers; the 512 B default returns 431 which browsers show as
# "Header fields are too long for server to interpret".
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=1024

# Subnet-scan discovery uses batches of parallel non-blocking sockets on top of
# httpd + Moonraker WS + DNS. 10 (the IDF default) leaves the WS client
# without a free socket if it tries to reconnect while a scan is running.
CONFIG_LWIP_MAX_SOCKETS=16
